Documents/ESB/ESB_Consumer_0819/003TestSample/SAMPLE_XML_MUST/CustomerTax/CT03_RefndWHTAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/CustomerTax/RefndWHTAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>CustomerTax</ServiceDomain>  
      <OperationName>RefndWHTAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:RefndWHTAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>CT03</v11:TxnId>  
        <v11:TxnNo>CT0300001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:Payload> 
          <!--1 or more repetitions:-->  
          <v11:AcctNoRec> 
            <v11:AcctNo>STR</v11:AcctNo> 
          </v11:AcctNoRec>  
          <!--1 or more repetitions:-->  
          <v11:IntrstDateInfo> 
            <v11:IntrstDate>STR</v11:IntrstDate> 
          </v11:IntrstDateInfo>  
          <!--1 or more repetitions:-->  
          <v11:RefundTaxAmtInfo> 
            <v11:RefundTaxAmt>12.0</v11:RefundTaxAmt> 
          </v11:RefundTaxAmtInfo>  
          <!--1 or more repetitions:-->  
          <v11:RecSeqNoInfo> 
            <v11:RecSeqNo>STR</v11:RecSeqNo> 
          </v11:RecSeqNoInfo>  
          <v11:CrCcy>STR</v11:CrCcy>  
          <v11:CrAcctNo>STR</v11:CrAcctNo> 
        </v11:Payload> 
      </v11:ServiceBody> 
    </v11:RefndWHTAddRq> 
  </soap:Body> 
</soap:Envelope>
